package Consult.Homework5;

import Consult.Homework5.Card1;

/**
 * Маскировка карты 2.0
 * ●	Создайте класс Card
 * ●	У класса должны быть поля:
 * ○	номер
 * ○	срок годности
 * ○	cvv
 * ○	pinCode
 * ●	Поля класса должны задаваться через конструктор
 * ●	Опишите в классе метод, который печатает номер карты в формате "**** **** **** 3456"
 * ●	Опишите в классе метод, который принимает на вход пин-код. Если переданный пин-код совпал с пин-кодом карты, напечатать в консоль
 * номер карты без маски (все цифры)
 * ●	Создайте класс MyProgram + метод psvm
 * ○	В методе создайте
 * новую карту
 * ○	Вызовите сначала метод печати с маской
 * ○	Потом метод печати с пин-кодом
 * ○	Убедитесь, что нельзя получить никакие данные карты напрямую через поля (используйте private)
 */
public class Task1MetodA {

    public static void main(String[] args) {

//        // Создание новой карты
//        Card1 cardNew = new Card1("1244 4513 7856 8563", "02.05.2024", "455");
//        cardNew.setPinCode("4578");
//        String userPinCode1 = cardNew.setPinCode("4578");
//
//        //Вывод с маской
//        cardNew.getCard();
//
//        //Вывод с пин-кодом
//        cardNew.getCard("4578");
//
//
   }

}
